{
  "backend/main.mo": "Motoko canister defining task, calendar, cooking assignment, and recurring chore types with profile management and permission-checked CRUD operations stored in in‑memory Maps.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, utilities, hooks, and styling files.",
  "frontend/index.css": "Tailwind base layer defining light and dark mode OKLCH color tokens and global background/foreground rules.",
  "frontend/index.html": "Basic HTML shell that loads the React app via main.tsx into the root element.",
  "frontend/src/App.tsx": "Main React app handling Internet Identity auth, theme provider setup, loading states, and tabbed navigation across core screens.",
  "frontend/src/components/AddTaskDialog.tsx": "Dialog for creating tasks with voice dictation, actor availability checks, field validation, and Principal parsing before submitting mutations.",
  "frontend/src/components/CalendarDayPlanner.tsx": "Daily planner showing tasks, cooking assignments, and recurring chores for a selected date with navigation and task completion toggling.",
  "frontend/src/components/CalendarView.tsx": "Top-level calendar UI offering month, week, and day views with tasks, cooking assignments, and recurring chores loading and navigation.",
  "frontend/src/components/CalendarWeekPlanner.tsx": "Weekly planner displaying tasks, cooking assignments, and recurring chores per day with week navigation and task toggling.",
  "frontend/src/components/DinnerRota.tsx": "Weekly cooking rota allowing assignment, editing, and meal descriptions with voice dictation and fairness stats.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task's name, description, due date, and assignee with voice dictation support.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying attribution with a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with branding, authentication controls, user menu, and theme selector.",
  "frontend/src/components/HeroHeader.tsx": "Renders a responsive hero header with background image, gradient overlay, and optional title/subtitle text.",
  "frontend/src/components/LightweightMonthOverview.tsx": "Displays a navigable monthly calendar showing tasks, cooking assignments, and optional recurring chores indicators.",
  "frontend/src/components/LoginScreen.tsx": "Provides a login UI using Internet Identity with a welcome card and sign‑in button.",
  "frontend/src/components/People.tsx": "Manages listing, creating, editing, and deleting person profiles with color selection and principal handling.",
  "frontend/src/components/PersonBadge.tsx": "Shows a small colored badge displaying a person's label with optional styling variants.",
  "frontend/src/components/PersonProfileSelect.tsx": "Allows selecting a person profile or manually entering a principal ID, with an option to auto-fill the current user.",
  "frontend/src/components/PopulateSampleDataAction.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/RecurringChoresDialog.tsx": "Full-screen dialog for creating, editing, pausing, and deleting recurring chores with voice dictation support.",
  "frontend/src/components/RecurringChoresInlineSection.tsx": "Displays a compact overview of grouped recurring chores with expand/collapse and a manage button.",
  "frontend/src/components/TaskList.tsx": "Displays grouped pending and completed tasks with controls for adding, editing, deleting, and managing recurring chores. Fetches tasks and profiles, handles loading states, and gates edits based on task ownership.",
  "frontend/src/components/ThemeModeControl.tsx": "Provides a dropdown to switch between light, dark, and system themes using next-themes.",
  "frontend/src/components/TodayFocus.tsx": "Shows tasks due today and today's cooking assignment with loading skeletons and simple task item rendering.",
  "frontend/src/components/VoiceDictationButton.tsx": "Renders a microphone button with tooltip, disabled states, and animated listening indicator for voice dictation controls.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithReadiness.ts": "Wraps useActor to provide readiness, initialization, and error state for safely gating backend mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, stored identities, and context access for authentication across the app.",
  "frontend/src/hooks/usePeopleProfilesQueries.ts": "Provides React Query hooks to fetch, update, and delete person profiles using the backend actor with readiness checks and toast notifications.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on backend tasks with actor readiness checks and toast notifications.",
  "frontend/src/hooks/useSeedSampleData.ts": "Empty file placeholder for sample data seeding hook.",
  "frontend/src/hooks/useSessionStorageState.ts": "Custom hook that syncs React state with sessionStorage and supports functional updates.",
  "frontend/src/hooks/useVoiceDictation.ts": "React hook wrapping Web Speech API with diagnostics, error handling, and transcript callbacks.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity provider before rendering the app.",
  "frontend/src/types/webSpeech.d.ts": "TypeScript definitions for the Web Speech API including SpeechRecognition types.",
  "frontend/src/utils/actorAvailability.ts": "Helpers to generate actor readiness messages and guard mutations when the backend is unavailable.",
  "frontend/src/utils/actorInitDiagnostics.ts": "Utilities for formatting and stringifying actor initialization diagnostics.",
  "frontend/src/utils/candidOption.ts": "Helpers for encoding optional Candid values consistently, especially Principals.",
  "frontend/src/utils/cookingAssignmentLabel.ts": "Functions to derive label and color information for cooking assignments using profiles and principals.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Diagnostic utilities for logging deployment and initialization steps with guidance on failures.",
  "frontend/src/utils/fairness.ts": "Computes fairness statistics for cooking assignments over various date ranges, counting occurrences per person and determining most/least cooked.",
  "frontend/src/utils/personProfiles.ts": "Resolves principals to display labels and colors using person profiles, with fallbacks to shortened principal strings.",
  "frontend/src/utils/principal.ts": "Provides safe parsing and validation utilities for principal strings, returning structured success or error results.",
  "frontend/src/utils/recurringChoreDiagnostics.ts": "Logs structured diagnostic information for recurring chore mutations, including payload details and mutation outcomes.",
  "frontend/src/utils/recurringChoreMutationErrors.ts": "Normalizes recurring chore errors into user-friendly messages and detailed diagnostics, handling various error types.",
  "frontend/src/utils/recurringChoresPreview.ts": "Generates preview data for recurring chores, including grouping by weekday, upcoming chores, and timeline labels.",
  "frontend/src/utils/recurringChoresSchedule.ts": "Determines whether recurring chores appear on specific dates based on frequency rules and filters chores for a given day.",
  "frontend/src/utils/taskDayKey.ts": "Converts due dates or Date objects into normalized yyyy-MM-dd day keys, including a helper for today's key.",
  "frontend/src/utils/taskDueDayGrouping.ts": "Groups tasks by normalized due date into sorted day groups, appending a 'No due date' group when applicable.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clean parameters from the hash.",
  "frontend/src/utils/voiceDictationDiagnostics.ts": "Implements diagnostic logging utilities for voice dictation events and environment checks without exposing transcript content.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, radius, and plugin integrations for the app’s design system.",
  "frontend/theme-scheme-suggestions.md": "Describes several proposed color schemes for the app and selects the Ocean Breeze palette for implementation.",
  "project_state.json": "Tracks the project’s current state, features, issues, and new requests for implementing selectable dark mode with persistence."
}