{
  "backend/main.mo": "Motoko canister implementing a household chores backend with tasks, recurring chores, cooking assignments, and calendar views, including authorization checks and ID-based storage. Provides CRUD operations for tasks and recurring chores and generates calendar data over date ranges.",
  "feature_evidence.json": "Feature evidence report documenting frontend changes that add an inline recurring chores preview to the task list and refactor task page header actions, with referenced files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summary map describing the purpose of major frontend React components, hooks, utilities, and styles used across the application.",
  "frontend/index.css": "Tailwind CSS base stylesheet defining global design tokens, light/dark theme variables, and foundational styles for layout, colors, and UI consistency.",
  "frontend/index.html": "Root HTML entry point that sets up metadata and mounts the React application into the #root element.",
  "frontend/src/App.tsx": "Main React application component handling authentication state, theme setup, and tab-based navigation between Task List, Dinner Rota, and Calendar views.",
  "frontend/src/components/AddTaskDialog.tsx": "Modal dialog component for creating new tasks with fields for name, description, assignee principal, and optional due date, integrated with backend mutation hooks.",
  "frontend/src/components/CalendarView.tsx": "Monthly calendar view that fetches tasks and cooking assignments from the backend and renders them in a navigable grid with day-by-day details.",
  "frontend/src/components/DinnerRota.tsx": "Renders a weekly dinner cooking rota, fetching assignments and allowing users to create or edit a cook for each day. Integrates Internet Identity principals, permission checks, and mutation hooks for assigning or updating cooking days.",
  "frontend/src/components/EditTaskDialog.tsx": "Modal dialog for editing an existing task’s name, description, due date, and assignee. Submits updates via a mutation hook and supports assigning the task to the current user’s principal.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright text and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Top navigation header showing the app title and, when authenticated, a user avatar dropdown with principal info and logout action. Clears query cache on logout.",
  "frontend/src/components/LoginScreen.tsx": "Full-page login screen prompting users to sign in with Internet Identity, showing branding, an illustration, and login status feedback.",
  "frontend/src/components/ProfileSetup.tsx": "Empty or placeholder file with no implementation content.",
  "frontend/src/components/RecurringChoresDialog.tsx": "Dialog for creating, editing, and deleting recurring weekly chores with name, description, weekday, and assignee. Uses query hooks, Internet Identity principals, and enforces edit permissions by creator.",
  "frontend/src/components/RecurringChoresInlineSection.tsx": "Inline dashboard section previewing recurring chores grouped by weekday, with loading states and a manage button. Shows a condensed list or empty-state prompt to add chores.",
  "frontend/src/components/TaskList.tsx": "Main UI component for displaying, grouping, and managing household tasks, including add/edit/delete, completion toggling, and clearing completed tasks. Integrates dialogs, recurring chores sections, identity-based permissions, and groups tasks by due day.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, handling anonymous vs authenticated actors and optional admin initialization. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication, including login, logout, identity persistence, and detailed login status flags. Wraps the app to expose the authenticated Identity to consumers.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as tasks, recurring chores, and related entities via the actor. Handles cache invalidation and user feedback with toast notifications.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining base styles and extensive CSS variables for light and dark themes, including colors, radius, and layout tokens. Applies consistent background, foreground, and border styling across the app.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and Internet Identity providers. Imports global styles and mounts the App component to the DOM.",
  "frontend/src/utils/recurringChoresPreview.ts": "Utility functions for grouping and sorting recurring chores by weekday relative to today, generating labeled groups and upcoming previews. Provides helpers for weekday labels and limited upcoming lists.",
  "frontend/src/utils/taskDueDayGrouping.ts": "Utility for grouping tasks by normalized calendar day based on due dates, sorting them chronologically, and appending a final \"No due date\" group. Formats display dates and handles nanosecond-to-millisecond conversion.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from both query strings and hash-based routes, persist them in sessionStorage, and retrieve or clear them with URL values taking precedence. Includes helpers to safely store, retrieve, and remove sensitive parameters like admin tokens during a session.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, dark mode behavior, container defaults, and extensive theme extensions for colors, border radius, shadows, and animations. Integrates typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current state, describing the app’s purpose, schema/versioning, and a catalog of implemented features. Documents authentication, actor initialization, admin token handling, access control, and core task/rota functionality."
}