{
  "backend/main.mo": "Motoko actor defining task, chore, calendar, cooking assignment, and profile types with access‑controlled CRUD operations and in‑memory maps.",
  "feature_evidence.json": "Feature evidence report linking frontend files to two actor‑readiness UI fixes with associated components and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, hooks, and utilities for tasks, profiles, recurring chores, and actor readiness.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme OKLCH color variables and global styling rules.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, loading states, and rendering header, TodayFocus, tabbed views, and footer.",
  "frontend/src/components/AddTaskDialog.tsx": "Dialog for creating tasks with actor‑readiness checks, voice dictation, validation, and task submission logic.",
  "frontend/src/components/CalendarDayPlanner.tsx": "Day planner showing tasks, cooking assignments, and recurring chores for a date with navigation and task completion toggling.",
  "frontend/src/components/CalendarView.tsx": "Main calendar view managing month/week/day modes, loading data, and mapping tasks, assignments, and chores to dates.",
  "frontend/src/components/CalendarWeekPlanner.tsx": "Displays a weekly planner with tasks, cooking assignments, and chores, including navigation and task completion toggling.",
  "frontend/src/components/DinnerRota.tsx": "Handles weekly cooking assignments with editing dialogs, profile selection, fairness metrics, and voice dictation for meal descriptions.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing task details, including assignee, due date, and voice dictation for name and description.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with app title and authenticated user menu including logout.",
  "frontend/src/components/HeroHeader.tsx": "Reusable hero-style header component with background image and optional title/subtitle overlay.",
  "frontend/src/components/LightweightMonthOverview.tsx": "Renders a lightweight calendar month view with task, cooking assignment, and recurring‑chore indicators and navigation controls.",
  "frontend/src/components/LoginScreen.tsx": "Shows a login page with branding and triggers Internet Identity authentication.",
  "frontend/src/components/People.tsx": "Manages viewing, adding, editing, and deleting person profiles with color tags and principal IDs.",
  "frontend/src/components/PersonBadge.tsx": "Displays a small badge with an optional color dot and customizable size and variant.",
  "frontend/src/components/PersonProfileSelect.tsx": "Provides a UI for selecting a person profile or manually entering a principal ID, with optional 'assign to me' button.",
  "frontend/src/components/PopulateSampleDataAction.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder component file.",
  "frontend/src/components/RecurringChoresDialog.tsx": "Full dialog for creating, editing, pausing, and deleting recurring chores with voice dictation support and validation.",
  "frontend/src/components/RecurringChoresInlineSection.tsx": "Inline dashboard section listing grouped recurring chores with expand/collapse and manage button.",
  "frontend/src/components/TaskList.tsx": "Displays and manages household tasks with grouping, editing, completion toggling, deletion, and recurring chores handling.",
  "frontend/src/components/TodayFocus.tsx": "Shows tasks due today and today's cooking assignment with loading states and simple task item rendering.",
  "frontend/src/components/VoiceDictationButton.tsx": "Provides a microphone toggle button with tooltip messaging, disabled handling, and a visual listening indicator.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorWithReadiness.ts": "Wraps useActor to expose readiness and initialization state for safely gating backend mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and loads stored identities using AuthClient.",
  "frontend/src/hooks/usePeopleProfilesQueries.ts": "Defines React Query hooks for fetching, updating, and deleting person profiles with actor readiness checks and toast notifications.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for fetching and mutating tasks and related backend data, with actor readiness checks and toast notifications.",
  "frontend/src/hooks/useSeedSampleData.ts": "Empty placeholder file for a future sample data seeding hook.",
  "frontend/src/hooks/useSessionStorageState.ts": "React hook that syncs state to sessionStorage with safe JSON handling and functional updates.",
  "frontend/src/hooks/useVoiceDictation.ts": "Hook implementing browser speech recognition with diagnostics, error handling, and transcript callbacks.",
  "frontend/src/index.css": "Tailwind setup and CSS variables defining light and dark theme design tokens.",
  "frontend/src/main.tsx": "App bootstrap wiring React, Internet Identity, React Query, and global styles.",
  "frontend/src/types/webSpeech.d.ts": "Ambient TypeScript definitions for the Web Speech API’s SpeechRecognition interfaces.",
  "frontend/src/utils/actorAvailability.ts": "Utilities to interpret and guard backend actor readiness with user-friendly messages.",
  "frontend/src/utils/actorInitDiagnostics.ts": "Helpers for formatting and logging actor initialization diagnostics and errors.",
  "frontend/src/utils/candidOption.ts": "Simple utilities for encoding optional Candid values without breaking serialization.",
  "frontend/src/utils/cookingAssignmentLabel.ts": "Functions to compute display labels and colors for cooking assignments using profiles and principals.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Structured diagnostic logger for deployment and initialization steps with timing, errors, and guidance.",
  "frontend/src/utils/fairness.ts": "Computes cooking assignment fairness metrics over various date ranges and returns counts, colors, and period metadata.",
  "frontend/src/utils/personProfiles.ts": "Resolves principals to display labels and colors using person profiles, with fallbacks to shortened principal strings.",
  "frontend/src/utils/principal.ts": "Provides safe parsing and validation utilities for principals, returning structured success/error results.",
  "frontend/src/utils/recurringChoreDiagnostics.ts": "Logs structured diagnostic information for recurring chore mutations, including payloads and outcomes.",
  "frontend/src/utils/recurringChoreMutationErrors.ts": "Normalizes backend errors for recurring chore operations into user-facing messages and diagnostic details.",
  "frontend/src/utils/recurringChoresPreview.ts": "Formats and groups recurring chores by weekday, provides timeline labels, and retrieves upcoming chores.",
  "frontend/src/utils/recurringChoresSchedule.ts": "Determines which recurring chores appear on specific dates based on timeline rules and filters by date.",
  "frontend/src/utils/taskDayKey.ts": "Converts dates and due timestamps into normalized yyyy-MM-dd day keys, including today's key.",
  "frontend/src/utils/taskDueDayGrouping.ts": "Groups tasks by normalized due date into sorted day groups with a final group for undated tasks.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, storing them in sessionStorage, and clearing stored or hash-based parameters.",
  "frontend/src/utils/voiceDictationDiagnostics.ts": "Defines logging utilities for voice dictation events and environment diagnostics without exposing transcript data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended color tokens, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Represents the project’s current state, known issues, and existing feature fixes related to the Add Task button readiness logic."
}