{
  "backend/main.mo": "Defines the backend canister with task, calendar, cooking assignment, recurring chore, and profile types plus CRUD operations guarded by access control.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptions of major frontend files, components, hooks, utilities, and UI behaviors for build planning.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, light/dark theme values, and global background/foreground rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling auth flow, loading states, and rendering TodayFocus plus tabbed views for tasks, dinner rota, calendar, and people.",
  "frontend/src/components/AddTaskDialog.tsx": "Dialog for creating tasks with voice dictation, actor readiness checks, error handling, and optional assignee/due date parsing.",
  "frontend/src/components/CalendarDayPlanner.tsx": "Displays tasks, cooking assignments, and recurring chores for a selected day with navigation and task toggling.",
  "frontend/src/components/CalendarView.tsx": "Provides month, week, and day calendar views with tasks, assignments, and recurring chores, including navigation and view switching.",
  "frontend/src/components/CalendarWeekPlanner.tsx": "Shows a week overview of tasks, cooking assignments, and recurring chores with navigation and task completion toggling.",
  "frontend/src/components/DinnerRota.tsx": "Manages weekly cooking assignments with editing dialogs, fairness stats, and voice dictation for meal descriptions.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task’s name, description, assignee, and due date with voice dictation support.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying credits and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with app branding and user menu supporting logout and principal display.",
  "frontend/src/components/HeroHeader.tsx": "Responsive header component displaying an image with optional title and subtitle overlays.",
  "frontend/src/components/LightweightMonthOverview.tsx": "Builds a navigable monthly calendar showing tasks, cooking assignments, and recurring chores.",
  "frontend/src/components/LoginScreen.tsx": "Login page using Internet Identity with branding and a sign‑in button.",
  "frontend/src/components/People.tsx": "Manages viewing, adding, editing, and deleting person profiles with color selection and principal handling.",
  "frontend/src/components/PersonBadge.tsx": "Renders a colored badge showing a person's label with optional styling.",
  "frontend/src/components/PersonProfileSelect.tsx": "Selector allowing choosing a person profile or manually entering a principal ID.",
  "frontend/src/components/PopulateSampleDataAction.tsx": "Empty file.",
  "frontend/src/components/ProfileSetup.tsx": "Empty file.",
  "frontend/src/components/RecurringChoresDialog.tsx": "Dialog for creating, editing, pausing, and deleting recurring chores with voice dictation support.",
  "frontend/src/components/RecurringChoresInlineSection.tsx": "Inline overview of recurring chores grouped by weekday with expand and manage actions.",
  "frontend/src/components/TaskList.tsx": "Renders the main task list UI with grouping, dialogs, and actions for creating, editing, completing, and deleting tasks. Loads tasks and profiles, handles user permissions, and shows loading skeletons.",
  "frontend/src/components/TodayFocus.tsx": "Displays tasks due today and the assigned cook, loading required data and showing a focused summary section. Includes a small task item component for rendering individual tasks.",
  "frontend/src/components/VoiceDictationButton.tsx": "Provides a microphone button with tooltip, disabled states, and a live listening indicator for voice dictation. Toggles between start and stop handlers and supports accessibility hints.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the user's identity using React Query. Recreates the actor when identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useActorWithReadiness.ts": "Wraps useActor to add readiness, initialization, and error states for safely gating backend mutations. Exposes combined actor status fields.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, initialization, and identity persistence via AuthClient. Wraps the app with an identity provider.",
  "frontend/src/hooks/usePeopleProfilesQueries.ts": "Defines React Query hooks for fetching, creating, updating, and deleting person profiles via the backend actor. Uses readiness checks and invalidates related queries on mutations.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on tasks and related backend mutations with actor readiness checks and toast feedback.",
  "frontend/src/hooks/useSeedSampleData.ts": "Empty placeholder file for a future hook to seed sample data.",
  "frontend/src/hooks/useSessionStorageState.ts": "Defines a React hook that syncs state to sessionStorage with safe read/write handling.",
  "frontend/src/hooks/useVoiceDictation.ts": "Implements a voice dictation hook using the Web Speech API with error handling, diagnostics, and transcript callbacks.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/types/webSpeech.d.ts": "TypeScript ambient definitions for the Web Speech API used by voice dictation.",
  "frontend/src/utils/actorAvailability.ts": "Utilities for checking backend actor readiness and producing user-friendly availability errors.",
  "frontend/src/utils/actorInitDiagnostics.ts": "Provides helpers for formatting and stringifying diagnostic context during actor initialization.",
  "frontend/src/utils/candidOption.ts": "Utilities for encoding optional Candid values consistently, especially Principals.",
  "frontend/src/utils/cookingAssignmentLabel.ts": "Functions to generate labels and colors for cooking assignments based on profiles and principals.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Structured diagnostic logging utilities for deployment and initialization steps with guidance on failures.",
  "frontend/src/utils/fairness.ts": "Computes fairness statistics for cooking assignments within various date ranges, counting occurrences per person and identifying most/least frequent cooks.",
  "frontend/src/utils/personProfiles.ts": "Provides helpers to resolve principals into display labels and colors, with fallbacks to shortened principal strings.",
  "frontend/src/utils/principal.ts": "Implements safe principal parsing and validation utilities that return structured results instead of throwing.",
  "frontend/src/utils/recurringChoreDiagnostics.ts": "Logs structured start and outcome details for recurring chore mutations with safe error stringification.",
  "frontend/src/utils/recurringChoreMutationErrors.ts": "Normalizes recurring chore mutation errors into user-facing messages and detailed diagnostics.",
  "frontend/src/utils/recurringChoresPreview.ts": "Provides utilities to label timelines, group recurring chores by weekday, get upcoming chores, and map weekday values to labels.",
  "frontend/src/utils/recurringChoresSchedule.ts": "Determines whether a recurring chore should appear on a given date based on frequency rules and filters chores by date.",
  "frontend/src/utils/taskDayKey.ts": "Converts task due dates or Date objects into normalized yyyy-MM-dd day keys and provides today's day key.",
  "frontend/src/utils/taskDueDayGrouping.ts": "Groups tasks by normalized day keys, sorts them chronologically, and appends a 'no due date' group when needed.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routes), and storing, retrieving, and clearing them in sessionStorage.",
  "frontend/src/utils/voiceDictationDiagnostics.ts": "Implements logging utilities for voice dictation lifecycle events and environment checks without exposing transcript content.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project state, known issues, and feature requests related to adding hero images and persistent data behavior."
}