{
  "backend/main.mo": "Defines actor with task, cooking assignment, calendar, recurring chore, and profile types plus CRUD logic secured by access control.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of major frontend components, hooks, utilities, and styles.",
  "frontend/index.css": "Tailwind base/theme variables for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "Basic HTML entry point loading the React app.",
  "frontend/src/App.tsx": "Root React component handling auth flow and rendering tabs for tasks, dinner rota, calendar, and people.",
  "frontend/src/components/AddTaskDialog.tsx": "Dialog for creating tasks with fields for name, description, due date, and assignee, using React Query mutation.",
  "frontend/src/components/CalendarDayPlanner.tsx": "Daily planner showing tasks, cooking assignments, and recurring chores for a selected date with editing and navigation controls.",
  "frontend/src/components/CalendarView.tsx": "Top-level calendar view supporting month, week, and day modes with task, assignment, and chore aggregation.",
  "frontend/src/components/CalendarWeekPlanner.tsx": "Weekly planner displaying tasks, cooking assignments, and recurring chores across a week with editing options.",
  "frontend/src/components/DinnerRota.tsx": "Interface for viewing, assigning, and editing weekly cooking assignments with fairness statistics.",
  "frontend/src/components/EditTaskDialog.tsx": "Modal dialog for editing a task’s name, description, assignee, and due date.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying attribution and external link.",
  "frontend/src/components/Header.tsx": "Header with app title, identity controls, sample data action, and logout menu.",
  "frontend/src/components/LightweightMonthOverview.tsx": "Renders a lightweight monthly calendar showing tasks, cooking assignments, and optional recurring chores with navigation controls. Builds per-day lookup maps and highlights selected dates and indicators.",
  "frontend/src/components/LoginScreen.tsx": "Displays a login screen with branding, an image, and a button to sign in using Internet Identity. Handles login state and shows loading feedback.",
  "frontend/src/components/People.tsx": "Manages creation, editing, and deletion of person profiles with names, colors, and principals. Provides dialogs, validation, and integration with profile queries.",
  "frontend/src/components/PersonBadge.tsx": "Renders a badge showing a person's label with an optional colored dot. Supports size and variant customization.",
  "frontend/src/components/PersonProfileSelect.tsx": "Provides a selector for choosing a profile or manually entering a principal ID, with an option to auto-fill the current user's principal. Supports switching between select and manual modes.",
  "frontend/src/components/PopulateSampleDataAction.tsx": "Button that seeds sample data into tasks, chores, assignments, and profiles, with confirmation if data already exists. Shows loading states and mutation progress.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder component file.",
  "frontend/src/components/RecurringChoresDialog.tsx": "Dialog for creating, editing, pausing, and deleting recurring chores with fields for frequency, weekday, assignee, and validation. Syncs with backend chore queries and resets state on close.",
  "frontend/src/components/RecurringChoresInlineSection.tsx": "Displays a collapsible preview of recurring chores grouped by weekday and provides a button to manage them.",
  "frontend/src/components/TaskList.tsx": "Shows household tasks with grouping, editing, completion toggling, and integrates the recurring chores section.",
  "frontend/src/components/TodayFocus.tsx": "Highlights tasks due today and today's cooking assignment, with loading states and simple task display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, including login, logout, and identity persistence.",
  "frontend/src/hooks/usePeopleProfilesQueries.ts": "Fetches, updates, and deletes person profiles through the actor with react-query and shows toast feedback.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on tasks and cooking-related data using an actor backend, with cache invalidation and toast notifications.",
  "frontend/src/hooks/useSeedSampleData.ts": "Mutation hook that seeds demo user data by ensuring a profile exists, adding sample tasks, toggling one complete, and creating recurring chores.",
  "frontend/src/hooks/useSessionStorageState.ts": "React hook that syncs state with sessionStorage, supporting JSON serialization and functional updates.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme design tokens and applying global styles.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, Internet Identity, and global styles.",
  "frontend/src/utils/candidOption.ts": "Helpers for safely encoding optional Candid values, returning undefined to represent empty optionals.",
  "frontend/src/utils/cookingAssignmentLabel.ts": "Utility functions for formatting cooking assignment labels, colors, and principal display strings.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Structured logging utilities for tracking deployment steps with success, failure, and guidance messaging.",
  "frontend/src/utils/fairness.ts": "Computes fairness statistics over cooking assignments for various date ranges, producing counts, colors, and summary data.",
  "frontend/src/utils/personProfiles.ts": "Helpers to resolve a principal to a label or color using person profiles, with fallbacks to shortened principals.",
  "frontend/src/utils/principal.ts": "Utilities for safely parsing and validating principal strings without throwing, returning structured results.",
  "frontend/src/utils/recurringChoreDiagnostics.ts": "Logging helpers that output structured diagnostics for recurring chore mutations and errors.",
  "frontend/src/utils/recurringChoreMutationErrors.ts": "Normalizes backend errors for recurring chore operations into user messages and diagnostic details.",
  "frontend/src/utils/recurringChoresPreview.ts": "Functions to label timelines and group or sort recurring chores by weekday for preview displays.",
  "frontend/src/utils/recurringChoresSchedule.ts": "Determines if recurring chores appear on a given date based on frequency and filters chores accordingly.",
  "frontend/src/utils/taskDayKey.ts": "Converts dates and due dates into normalized day keys in yyyy-MM-dd format.",
  "frontend/src/utils/taskDueDayGrouping.ts": "Groups tasks by normalized day keys, sorts them, and adds a no-due-date group.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH color tokens, container settings, extended theme utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Structured snapshot of the project's feature set, including authentication, RBAC, people profiles, and chore/task functionality, used as a machine-readable record of system capabilities."
}