{
  "backend/main.mo": "Motoko canister defining core domain models (tasks, calendar days, cooking assignments, recurring chores, people profiles) and state, with access-controlled APIs for managing profiles, tasks, cooking rota, and recurring chores.",
  "feature_evidence.json": "Machine-readable report describing implemented frontend features around a persistent Today Focus section, including associated files, dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend source files, outlining responsibilities of components, hooks, utilities, and styles across the React application.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, OKLCH-based color variables, and light/dark theme styles for the application.",
  "frontend/index.html": "Base HTML entry point that mounts the React app to the root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component handling authentication flow, theme setup, header/footer layout, persistent TodayFocus panel, and tab-based navigation between main views.",
  "frontend/src/components/AddTaskDialog.tsx": "Modal dialog component for creating new tasks, with form fields for name, description, assignee selection via profiles or principal ID, optional due date picker, and submission via React Query.",
  "frontend/src/components/CalendarDayPlanner.tsx": "Renders a single-day planner showing tasks, cooking assignments, and recurring chores for a selected date, with navigation between days. Fetches required data via hooks and allows toggling task completion.",
  "frontend/src/components/CalendarView.tsx": "Top-level calendar container that manages month/week/day views, current month, and selected date. Aggregates tasks, cooking assignments, and chores to pass into specialized planners and overviews.",
  "frontend/src/components/CalendarWeekPlanner.tsx": "Displays a week-long planner with daily columns showing tasks, cooking assignments, and recurring chores. Supports week navigation and toggling task completion.",
  "frontend/src/components/DinnerRota.tsx": "Provides a weekly dinner rota for assigning or editing cooking duties, including dialogs to set cooks and fairness statistics. Integrates identity-based permissions and profile selection.",
  "frontend/src/components/EditTaskDialog.tsx": "Modal dialog for editing an existing task’s name, description, assignee, and due date. Submits updates via a mutation hook and handles principal parsing.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright text and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with branding and an authenticated user menu. Shows principal info and supports logout by clearing identity and query cache.",
  "frontend/src/components/LightweightMonthOverview.tsx": "Renders a compact month calendar view with navigation, highlighting selected day, today, days with tasks, and days with cooking assignments. Uses memoized maps for tasks and assignments and callbacks for month/date changes.",
  "frontend/src/components/LoginScreen.tsx": "Displays a login screen for the app with branding and a button to authenticate via Internet Identity. Handles login state and shows a loading indicator while signing in.",
  "frontend/src/components/People.tsx": "Provides UI to list, add, edit, and delete family member profiles with display names, colors, and principals. Integrates with profile query/mutation hooks and restricts editing to the current user.",
  "frontend/src/components/PersonBadge.tsx": "Reusable badge component that displays a person label with an optional colored dot and size/variant options. Used to visually represent people across the UI.",
  "frontend/src/components/PersonProfileSelect.tsx": "Form control for assigning a task or item to a person, allowing selection from existing profiles or manual principal entry. Supports a \"Me\" shortcut using the current Internet Identity.",
  "frontend/src/components/ProfileSetup.tsx": "Empty or placeholder file intended for future profile setup functionality.",
  "frontend/src/components/RecurringChoresDialog.tsx": "Full-screen dialog for creating, editing, pausing, resuming, and deleting recurring chores with scheduling, assignment, and validation logic. Fetches and mutates recurring chore data via query hooks.",
  "frontend/src/components/RecurringChoresInlineSection.tsx": "Inline summary card showing existing recurring chores grouped by weekday, with quick access to manage them. Displays loading, empty, and preview states using grouped chore data.",
  "frontend/src/components/TaskList.tsx": "Main task management UI that lists pending and completed household tasks, grouped by due day, with controls to add, edit, delete, complete, and clear tasks, plus recurring chores sections.",
  "frontend/src/components/TodayFocus.tsx": "Dashboard card that highlights tasks due today and today’s cooking assignment, handling loading states and simple read-only task display.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous backend actor based on Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login/logout, identity persistence, and login status via an AuthClient-backed React context provider.",
  "frontend/src/hooks/usePeopleProfilesQueries.ts": "React Query hooks for fetching, creating/updating, and deleting person profiles from the backend, with cache invalidation and toast notifications.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for tasks, cooking assignments, recurring chores, and related mutations, handling backend calls, cache invalidation, and user feedback.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens, color variables for light/dark themes, and base styles for the application.",
  "frontend/src/main.tsx": "Application entry point that initializes React Query, wraps the app with Internet Identity and query providers, and mounts the root React component.",
  "frontend/src/utils/cookingAssignmentLabel.ts": "Provides helper functions to derive display labels and colors for cooking assignments, preferring profile display names and colors, then falling back to cook names or shortened principals.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Implements structured diagnostic logging utilities to track deployment and initialization steps, including timing, error reporting, and actionable guidance.",
  "frontend/src/utils/fairness.ts": "Computes fairness statistics for cooking assignments over configurable time ranges, aggregating counts, colors, and most/least cooked summaries based on profiles and dates.",
  "frontend/src/utils/personProfiles.ts": "Utilities to resolve a principal to a display label and color using person profiles, with fallbacks to shortened principal strings.",
  "frontend/src/utils/principal.ts": "Defines safe parsing and validation helpers for ICP principals, returning structured success or error results instead of throwing exceptions.",
  "frontend/src/utils/recurringChoresPreview.ts": "Helpers for presenting recurring chores, including grouping by weekday, sorting relative to today, and generating user-friendly weekday and timeline labels.",
  "frontend/src/utils/recurringChoresSchedule.ts": "Determines whether recurring chores should appear on specific dates based on weekday, frequency (weekly, fortnightly, monthly), and paused state.",
  "frontend/src/utils/taskDayKey.ts": "Date utilities for normalizing task due dates into consistent day key strings and retrieving today’s day key.",
  "frontend/src/utils/taskDueDayGrouping.ts": "Groups tasks by normalized due-date day, sorts them chronologically, and appends a final group for tasks without due dates.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session-based parameters, supporting both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container settings, and extensive theme extensions for colors, radii, shadows, and animations using CSS variables. It enables typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current state, schema version, and high-level summary for the Family House Duties ICP dapp. It enumerates existing features with IDs, descriptions, and versions to track implemented functionality and evolution."
}