{
  "backend/main.mo": "Motoko canister defining task, cooking assignment, recurring chore, and profile types with CRUD operations protected by access control.",
  "feature_evidence.json": "Feature evidence report describing a color‑scheme update with affected frontend files and related components.",
  "frontend-file-summaries.txt": "Text file containing prewritten one‑sentence summaries of various frontend source files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "HTML entrypoint setting up the root div and loading the main React script.",
  "frontend/src/App.tsx": "Main React app handling authentication flow and rendering header, tabs, TodayFocus, and routed sections.",
  "frontend/src/components/AddTaskDialog.tsx": "Dialog component for adding tasks with actor‑readiness checks, voice dictation, validation, and mutation submission.",
  "frontend/src/components/CalendarDayPlanner.tsx": "Day‑planner view aggregating tasks, cooking assignments, and recurring chores for a selected date with navigation controls.",
  "frontend/src/components/CalendarView.tsx": "Main calendar view managing month/week/day modes, loading tasks, assignments, and chores, and rendering planners accordingly.",
  "frontend/src/components/CalendarWeekPlanner.tsx": "Displays a week grid with tasks, cooking assignments, and chores, with navigation and task completion toggling.",
  "frontend/src/components/DinnerRota.tsx": "Manages weekly cooking assignments with editing, meal descriptions, fairness stats, and voice dictation support.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog for editing a task’s name, description, assignee, and due date, including voice dictation integration.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing app branding and user menu with logout for authenticated users.",
  "frontend/src/components/HeroHeader.tsx": "Reusable hero banner with background image, gradient overlay, and optional title/subtitle.",
  "frontend/src/components/LightweightMonthOverview.tsx": "Renders a monthly calendar grid showing tasks, cooking assignments, and recurring chores with navigation controls. Uses memoized maps for quick daily lookups and allows date selection.",
  "frontend/src/components/LoginScreen.tsx": "Displays a login page with Internet Identity authentication and branding visuals. Handles login state and error logging.",
  "frontend/src/components/People.tsx": "Manages creation, editing, and deletion of people profiles with dialogs and color selection. Loads profiles, allows principal assignment, and restricts edits to the current user.",
  "frontend/src/components/PersonBadge.tsx": "Shows a styled badge for a person with optional color indicator and size/variant options.",
  "frontend/src/components/PersonProfileSelect.tsx": "Provides a selector for choosing or manually entering a principal ID, with optional 'Me' autofill and fallback manual mode.",
  "frontend/src/components/PopulateSampleDataAction.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder component file.",
  "frontend/src/components/RecurringChoresDialog.tsx": "Modal for creating, editing, deleting, pausing, and resuming recurring chores with voice dictation support and principal validation.",
  "frontend/src/components/RecurringChoresInlineSection.tsx": "Inline summary section displaying grouped recurring chores with expand/collapse and a shortcut to manage them.",
  "frontend/src/components/TaskList.tsx": "Displays, groups, and manages household tasks with add, edit, delete, and completion features using multiple dialogs and hooks.",
  "frontend/src/components/TodayFocus.tsx": "Shows tasks due today and today's cooking assignment, with loading states and small task-list rendering.",
  "frontend/src/components/VoiceDictationButton.tsx": "Provides a voice dictation button with support checks, dynamic tooltips, and a listening indicator.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithReadiness.ts": "Wraps useActor to expose readiness, initialization, and error states for safely gating mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and stored identity loading through context.",
  "frontend/src/hooks/usePeopleProfilesQueries.ts": "Implements profile queries and mutations using the actor, including fetch, upsert, and delete with readiness checks and toast notifications.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on tasks and related backend interactions with actor readiness checks and toast notifications.",
  "frontend/src/hooks/useSeedSampleData.ts": "Empty placeholder hook file for seeding sample data.",
  "frontend/src/hooks/useSessionStorageState.ts": "React hook that syncs state with sessionStorage, supporting functional updates and error-safe persistence.",
  "frontend/src/hooks/useVoiceDictation.ts": "Implements a voice dictation hook wrapping the Web Speech API with diagnostics, error handling, and transcript callbacks.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, identity provider, and global styles.",
  "frontend/src/types/webSpeech.d.ts": "Type definitions for the Web Speech API, adding SpeechRecognition typings to TypeScript.",
  "frontend/src/utils/actorAvailability.ts": "Utilities for checking and guarding backend actor readiness with user-friendly error messages.",
  "frontend/src/utils/actorInitDiagnostics.ts": "Provides helpers to format and stringify actor initialization diagnostics and errors.",
  "frontend/src/utils/candidOption.ts": "Utilities for safely encoding optional Candid values, including principals, for backend calls.",
  "frontend/src/utils/cookingAssignmentLabel.ts": "Functions to derive display labels and colors for cooking assignments, with profile matching and principal formatting.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Structured diagnostic logging utilities for deployment and initialization steps with guidance on failures.",
  "frontend/src/utils/fairness.ts": "Computes cooking-assignment fairness stats over date ranges, counting occurrences per person and determining most/least cooked.",
  "frontend/src/utils/personProfiles.ts": "Resolves principals to display names and colors, with fallbacks to shortened IDs.",
  "frontend/src/utils/principal.ts": "Provides safe principal parsing and validation utilities that return structured results.",
  "frontend/src/utils/recurringChoreDiagnostics.ts": "Logs structured start and outcome diagnostics for recurring chore mutations with safe error stringification.",
  "frontend/src/utils/recurringChoreMutationErrors.ts": "Normalizes recurring chore errors into user-friendly messages and diagnostic strings.",
  "frontend/src/utils/recurringChoresPreview.ts": "Generates timeline labels, groups recurring chores by weekday, and computes upcoming chores.",
  "frontend/src/utils/recurringChoresSchedule.ts": "Determines whether recurring chores appear on specific dates based on timeline rules and filters chores for a date.",
  "frontend/src/utils/taskDayKey.ts": "Converts dates and nanosecond timestamps to normalized day keys and retrieves today's key.",
  "frontend/src/utils/taskDueDayGrouping.ts": "Groups tasks by due date into sorted day buckets, adding a final group for tasks without due dates.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters (including hash routing) and persisting them in sessionStorage.",
  "frontend/src/utils/voiceDictationDiagnostics.ts": "Diagnostic logger for voice dictation events, errors, and environment context.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, animations, containers, and plugin setup.",
  "frontend/theme-scheme-suggestions.md": "Design document outlining three color palette options and selecting Ocean Breeze as the default scheme.",
  "project_state.json": "Project state file containing metadata, existing features, and pending feature requests."
}