{
  "backend/main.mo": "Motoko canister implementing the backend domain for a family duties app, defining tasks, recurring chores, cooking assignments, calendar views, and people profiles with Map-based storage. Exposes shared/query methods with access control and authorization checks for creating, updating, querying, and managing these entities.",
  "feature_evidence.json": "Structured report documenting implemented frontend features related to recurring chore reliability, diagnostics, and UI correctness, including affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of key frontend source files, describing each component’s responsibility, UI behavior, and supporting utilities across the React application.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens (colors, radius, charts, sidebar) and base styles for the application.",
  "frontend/index.html": "Root HTML entry point that mounts the React app to the #root element and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Top-level React component handling authentication state, theme setup, global layout, and tab-based navigation between Tasks, Dinner Rota, Calendar, and People views.",
  "frontend/src/components/AddTaskDialog.tsx": "Dialog form component for creating new tasks, managing local form state, optional due date and assignee selection, and submitting via a React Query mutation with reset-on-success behavior.",
  "frontend/src/components/CalendarDayPlanner.tsx": "Renders a single-day planner showing tasks, cooking assignment, and recurring chores for a selected date, with navigation controls and task completion toggling. Fetches all required data via query hooks and derives day-specific views with memoization.",
  "frontend/src/components/CalendarView.tsx": "Top-level calendar container that manages month/week/day views, current date state, and navigation. Aggregates tasks, cooking assignments, chores, and profiles to pass into specialized planner components.",
  "frontend/src/components/CalendarWeekPlanner.tsx": "Displays a week-at-a-glance planner with daily columns for tasks, cooking assignments, and chores, including navigation between weeks. Groups tasks and assignments by day key and supports task completion toggling.",
  "frontend/src/components/DinnerRota.tsx": "Weekly dinner rota management UI allowing users to view, assign, or edit cooking responsibilities with fairness statistics. Integrates identity checks to restrict edits and supports selecting cooks via profiles or principals.",
  "frontend/src/components/EditTaskDialog.tsx": "Modal dialog for editing an existing task’s name, description, assignee, and due date. Handles form state, principal parsing, and submits updates through a mutation hook.",
  "frontend/src/components/Footer.tsx": "Simple application footer displaying copyright text and an external link with branding.",
  "frontend/src/components/Header.tsx": "Application header showing branding and an authenticated user menu with principal info and logout functionality. Integrates Internet Identity state and clears cached queries on logout.",
  "frontend/src/components/LightweightMonthOverview.tsx": "Renders a compact month calendar view with navigation, highlighting selected day, today, days with tasks, and days with cooking assignments. Uses date-fns and memoized maps to efficiently derive per-day task and assignment indicators.",
  "frontend/src/components/LoginScreen.tsx": "Displays a login page with branding and a call-to-action button to authenticate via Internet Identity. Manages login state and disables the button while authentication is in progress.",
  "frontend/src/components/People.tsx": "Provides CRUD UI for managing family member profiles (principal, display name, color), with dialogs for add/edit and permission checks. Integrates with profile query/mutation hooks and Internet Identity.",
  "frontend/src/components/PersonBadge.tsx": "Small presentational component that renders a badge with an optional colored dot and configurable size and variant. Used to visually label people throughout the UI.",
  "frontend/src/components/PersonProfileSelect.tsx": "Input component for assigning a task to a person, supporting selection from saved profiles or manual principal entry. Includes a shortcut to assign the current user via Internet Identity.",
  "frontend/src/components/ProfileSetup.tsx": "Empty file placeholder with no implementation.",
  "frontend/src/components/RecurringChoresDialog.tsx": "Full-screen dialog for creating, editing, pausing, resuming, and deleting recurring chores with scheduling and assignment options. Handles form state, validation, and integrates with recurring chore query and mutation hooks.",
  "frontend/src/components/RecurringChoresInlineSection.tsx": "Inline dashboard section that summarizes recurring chores grouped by weekday, with expandable preview and manage/add actions. Fetches chores and displays loading skeletons when data is unavailable.",
  "frontend/src/components/TaskList.tsx": "Main task management UI that lists pending and completed household tasks, grouped by due day, with add/edit/delete/complete actions and recurring chores integration.",
  "frontend/src/components/TodayFocus.tsx": "Dashboard card showing tasks due today and today’s cooking assignment, combining task, profile, and assignment data with loading states.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, reinitializing and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login/logout flow, persisted identities, and detailed login status flags.",
  "frontend/src/hooks/usePeopleProfilesQueries.ts": "React Query hooks for fetching, creating/updating, and deleting person profiles via the backend actor, with cache invalidation and toast notifications.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for tasks, cooking assignments, recurring chores, and timelines, handling backend mutations, cache invalidation, and user feedback.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes, global color tokens, and base styles for the application.",
  "frontend/src/main.tsx": "Frontend entry point that renders the app with React Query and Internet Identity providers and applies global styles.",
  "frontend/src/utils/candidOption.ts": "Provides helpers to pass optional values (including Principal) to Candid consistently, relying on undefined being encoded as an empty optional by the agent.",
  "frontend/src/utils/cookingAssignmentLabel.ts": "Generates display labels and colors for cooking assignments by resolving profiles, cook names, or shortened principals, with fallbacks for unassigned cases.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Implements structured diagnostic logging for deployment and initialization steps, including timing, error reporting, guidance, and an async wrapper.",
  "frontend/src/utils/fairness.ts": "Computes fairness statistics for cooking assignments over configurable time ranges, aggregating counts, colors, most/least cooked, and human-readable period labels.",
  "frontend/src/utils/personProfiles.ts": "Resolves principals to display labels and colors using person profiles, with fallbacks to shortened principal strings.",
  "frontend/src/utils/principal.ts": "Safely parses and validates principal strings, returning structured success or error results without throwing, and helpers for form validation.",
  "frontend/src/utils/recurringChoreDiagnostics.ts": "Provides structured console logging for recurring chore mutations, capturing payload details, outcomes, and safely stringified errors.",
  "frontend/src/utils/recurringChoreMutationErrors.ts": "Normalizes recurring chore mutation errors into user-facing messages and detailed diagnostics by inspecting common backend and serialization failure patterns.",
  "frontend/src/utils/recurringChoresPreview.ts": "Supplies utilities to label timelines, group recurring chores by weekday starting from today, and compute upcoming chores for preview displays.",
  "frontend/src/utils/recurringChoresSchedule.ts": "Implements date-based logic to determine whether a recurring chore appears on a given day, supporting weekly, fortnightly (with a fixed reference date), and monthly schedules while excluding paused chores. Also provides a helper to filter a list of chores for a specific date.",
  "frontend/src/utils/taskDayKey.ts": "Provides utilities to normalize task due dates or Date objects into local day-level keys (yyyy-MM-dd) and to get today’s day key, using date-fns formatting.",
  "frontend/src/utils/taskDueDayGrouping.ts": "Groups tasks by normalized calendar day based on due dates, sorts groups chronologically, formats display labels, and appends a trailing \"No due date\" group when applicable.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters from query strings or hash-based routes, persisting them in sessionStorage, and managing their lifecycle (get, store, clear) for navigation-safe state.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content sources, dark mode, container defaults, extensive theme extensions (colors via CSS variables, radii, shadows, animations), and registered plugins.",
  "project_state.json": "Project metadata describing the Family House Duties ICP dapp, including a high-level summary and a versioned list of existing features such as authentication, role-based access control, and task management."
}