{
  "kind": "build_request",
  "title": "Add clear UI indicator when voice dictation microphone is actively listening",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Enhance the voice dictation UI so it provides a clear, subtle visual cue when the microphone is actively listening (i.e., SpeechRecognition has started), beyond the current icon pulse, and ensure the cue is visible in all places the VoiceDictationButton is used (e.g., AddTaskDialog and EditTaskDialog dictation controls).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "Yes, let's add a certain UI cue when the mic is actually listening."
        ]
      },
      "acceptanceCriteria": [
        "When dictation is actively listening, the mic control has an additional visible indicator (e.g., a small red 'live' dot, glow ring, or similar subtle accent) that is not shown when not listening.",
        "The listening indicator turns on only while `isListening` is true for the active dictation field, and turns off immediately when dictation stops/ends/errors.",
        "The indicator is visible and legible on both light and dark themes and does not rely solely on color (e.g., uses shape/animation as well).",
        "The existing tooltip behavior remains correct (Start voice dictation vs Stop dictation), and the button remains operable on mobile."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add accessibility semantics for the listening state on the dictation control so assistive technologies can detect when dictation is active.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "Yes, let's add a certain UI cue when the mic is actually listening."
        ]
      },
      "acceptanceCriteria": [
        "When listening, the dictation control exposes an appropriate state to screen readers (e.g., `aria-pressed=true` and/or an `aria-live` status text that announces \"Listening\" / \"Not listening\").",
        "User-facing accessibility text is in English.",
        "No accessibility attributes are added to any immutable-path files."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn UI sources are read-only).",
    "Do not modify any paths listed as immutable in SYSTEM_CONTEXT (compose existing hooks/components instead).",
    "Keep the backend single-actor architecture unchanged; no backend changes are required for this UI-only cue."
  ],
  "nonGoals": [
    "Do not add new authentication methods or third-party integrations.",
    "Do not implement audio visualization, waveform rendering, or real-time transcription UI beyond the listening cue.",
    "Do not change the underlying Web Speech API start/stop logic unless required to correctly reflect the existing `isListening` state."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}