{
  "kind": "build_request",
  "title": "Propose and apply a nicer app color scheme (light/dark)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Provide 3 distinct, coherent color scheme suggestions for the app (each with a short name and a brief description), and implement one chosen default scheme by updating the app’s theme tokens (CSS variables) so the updated palette applies consistently across the existing UI (header, tabs, cards, buttons, dialogs, gradients) in both light and dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you give the app a nicer color scheme? You give me the suggestions."
        ]
      },
      "acceptanceCriteria": [
        "A short list of 3 color scheme suggestions is included in the change description (name + brief description for each).",
        "One scheme is selected as the default and applied by modifying the existing theme CSS variables in frontend/src/index.css for both :root (light) and .dark (dark).",
        "Primary/secondary/accent/muted/background/foreground/border/ring/destructive/success and chart/sidebar tokens remain defined and produce a cohesive look.",
        "The Login screen background gradient (currently using from-background to muted/20) and key UI surfaces (Header bg-card, Cards, TabsList) visually reflect the new palette without requiring component-by-component hardcoded colors.",
        "Text contrast remains readable in both light and dark mode (e.g., primary buttons have clear primary-foreground contrast; muted-foreground remains legible on muted backgrounds)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (immutable paths).",
    "Keep theming implemented via existing Tailwind + CSS variable tokens (oklch(var(--...))) rather than introducing a new styling system.",
    "Do not add new authentication providers; Internet Identity remains the only auth mechanism."
  ],
  "nonGoals": [
    "Adding new product features or screens beyond updating the visual theme.",
    "Backend changes or schema/state migrations.",
    "Replacing or regenerating existing images (e.g., the login illustration) unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}