{
  "kind": "build_request",
  "title": "Fix Add Task button being disabled due to incorrect actor readiness gating",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the actor readiness logic so the Add Task submit button is not incorrectly disabled (grayed out) when the backend actor already exists but React Query reports a fetch in progress.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The add task function is not working correctly. It seems to be grayed out or disabled. Can you please fix this?"
        ]
      },
      "acceptanceCriteria": [
        "When the user opens the Add Task dialog, the “Add Task” submit button becomes enabled as soon as the actor is available (even if a background fetch is happening), as long as a non-empty task name is provided and no mutation is pending.",
        "The submit button remains disabled only when: task name is empty, addTask mutation is pending, or actor initialization has not produced an actor yet, or initialization errored.",
        "The user can successfully add a task end-to-end: enter a task name, click “Add Task”, see success toast, dialog closes, and the task list updates."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the disabled state messaging for the Add Task submit button remains accurate and user-friendly while the actor is initializing or has failed to initialize.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It seems to be grayed out or disabled."
        ]
      },
      "acceptanceCriteria": [
        "If the backend actor is still initializing (no actor yet), the dialog shows the existing connection message (“Connecting to backend… please wait a moment.”) and the submit button stays disabled.",
        "If backend initialization fails, the dialog shows the existing failure message (“Backend connection failed. Please refresh the page and try again.”) and the submit button stays disabled.",
        "If the only reason the button is disabled is missing task name, the tooltip/title explains “Task name is required.”"
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI components).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths)."
  ],
  "nonGoals": [
    "Adding new task features (e.g., new fields, categories, priorities).",
    "Changing backend task schema or authorization logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}