{
  "kind": "build_request",
  "title": "Add persistent Today Focus panel showing today's tasks and cook across all views",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a persistent \"Today Focus\" section rendered at the top of the authenticated app content (below the Header and above the tab navigation/content) so it remains visible regardless of which main view/tab is active (Tasks, Dinner Rota, Calendar, People).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can you add a Today focus section\nA small panel at the top showing only today’s tasks and today’s cook, regardless of which view you’re in."
        ]
      },
      "acceptanceCriteria": [
        "When signed in, the Today Focus panel appears on all tabs without navigating away from the current view.",
        "The Today Focus panel is positioned above the TabsList/tab content within the main app layout.",
        "User-facing text uses English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the Today Focus section, display only tasks that are due today (based on local calendar day) and show today’s assigned cook for today’s day key; do not include tasks for other days or tasks without a due date.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "showing only today’s tasks and today’s cook"
        ]
      },
      "acceptanceCriteria": [
        "Tasks shown in Today Focus are limited to those whose dueDate maps to today’s local day key (yyyy-MM-dd).",
        "Tasks with no dueDate are not shown in Today Focus.",
        "Today’s cook shown corresponds to the cooking assignment for today’s day key (yyyy-MM-dd)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement appropriate loading and empty states within the Today Focus section using existing data sources (React Query hooks) so the panel remains stable and informative while tasks/cooking assignments (and profiles if used for labels) are loading or absent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "A small panel at the top showing only today’s tasks and today’s cook"
        ]
      },
      "acceptanceCriteria": [
        "While relevant queries are loading, the Today Focus panel shows a skeleton/placeholder state instead of disappearing.",
        "If there are no tasks due today, the panel clearly indicates there are no tasks due today.",
        "If there is no cooking assignment for today, the panel clearly indicates no cook is assigned for today.",
        "If profiles are available, the cook label in the panel prefers profile display names (consistent with existing cook label logic)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*). Compose existing UI components instead.",
    "Respect the existing React Query caching and invalidation patterns (reuse existing hooks where possible)."
  ],
  "nonGoals": [
    "Do not add new backend endpoints or change backend schema solely for the Today Focus panel.",
    "Do not change existing task/calendar/dinner rota behavior beyond adding the new persistent Today Focus display."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}