{
  "kind": "build_request",
  "title": "Add edit/delete controls for tasks and recurring chores in calendar views",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add per-task Edit and Delete UI controls to the calendar day view (frontend/src/components/CalendarDayPlanner.tsx) for tasks scheduled on the selected day. Edit must open the existing EditTaskDialog for that task, and Delete must prompt for confirmation before calling the existing delete task mutation. Only show Edit/Delete controls when the current user is the task creator (task.createdBy matches the authenticated principal).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add the ability to delete and edit each task and recurring chore"
        ]
      },
      "acceptanceCriteria": [
        "In the day planner task list, each task created by the current user shows Edit and Delete controls.",
        "Clicking Edit opens the existing task edit dialog pre-filled with that task’s fields and successfully saves via the existing update path.",
        "Clicking Delete shows a confirmation prompt and, on confirmation, deletes the task via the existing mutation and refreshes the calendar/task data (React Query invalidation).",
        "Tasks not created by the current user do not show Edit/Delete controls."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add per-task Edit and Delete UI controls to the calendar week view (frontend/src/components/CalendarWeekPlanner.tsx) for tasks on each day. Edit must open the existing EditTaskDialog, and Delete must prompt for confirmation before calling the existing delete task mutation. Only show Edit/Delete controls when the current user is the task creator.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add the ability to delete and edit each task and recurring chore"
        ]
      },
      "acceptanceCriteria": [
        "In the week planner, tasks created by the current user show Edit/Delete controls on their task row/card.",
        "Edit opens EditTaskDialog and successfully updates the task.",
        "Delete confirms and successfully removes the task, with UI reflecting the change without a full page reload.",
        "Tasks not created by the current user do not show Edit/Delete controls."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add edit/delete access for recurring chores from calendar views by enabling a user to initiate editing or deletion of a recurring chore shown in CalendarDayPlanner and CalendarWeekPlanner. Editing must route through the existing recurring chore update flow and deletion must prompt for confirmation before calling the existing recurring chore delete mutation. Only allow these actions when the current user is the recurring chore creator (chore.createdBy matches the authenticated principal).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add the ability to delete and edit each task and recurring chore"
        ]
      },
      "acceptanceCriteria": [
        "In both day and week planner recurring chores sections, chores created by the current user expose Edit/Delete actions (or an equivalent per-chore action menu).",
        "Edit allows changing recurring chore fields and persists changes via the existing updateRecurringChore mutation (with expected React Query invalidation so calendar/task views refresh).",
        "Delete prompts for confirmation and deletes via the existing deleteRecurringChore mutation, removing the chore from relevant views after refresh/invalidation.",
        "Recurring chores not created by the current user do not show Edit/Delete actions."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn components are read-only and must be composed, not edited).",
    "Do not modify any frontend paths listed in SYSTEM_CONTEXT.frontend.immutablePaths."
  ],
  "nonGoals": [
    "Do not implement new backend CRUD APIs for tasks or recurring chores (use existing endpoints).",
    "Do not change authorization rules (creator-only edits/deletes must remain enforced).",
    "Do not address unrelated known issues (e.g., backend getCalendar() correctness, due-date timestamp equality, upgrade persistence) as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}