{
  "kind": "build_request",
  "title": "Add user-selectable dark mode (light/dark/system) with persistence",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a theme mode control (Light / Dark / System) to the authenticated app header UI so users can switch between themes at runtime.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes please add a dark mode feature too"
        ]
      },
      "acceptanceCriteria": [
        "When signed in, the Header includes a clearly discoverable control (e.g., in the user dropdown) to select Light, Dark, or System theme.",
        "Selecting a theme updates the app styling immediately without requiring a page refresh.",
        "The control uses English labels: \"Light\", \"Dark\", \"System\"."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Persist the user’s selected theme mode across sessions and apply it consistently on both the login screen and the authenticated app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes please add a dark mode feature too"
        ]
      },
      "acceptanceCriteria": [
        "If the user selects Light/Dark/System, the choice is retained after reload and browser restart.",
        "The login screen (unauthenticated view) and the authenticated app both reflect the stored theme selection.",
        "Default behavior remains \"System\" when the user has not explicitly chosen a theme."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the existing Tailwind/Shadcn theme tokens apply correctly in dark mode across major screens (Task List, Dinner Rota, Calendar, People) without introducing low-contrast text or broken component backgrounds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes please add a dark mode feature too"
        ]
      },
      "acceptanceCriteria": [
        "In Dark mode, text on cards, dialogs, dropdowns, tabs, and muted sections remains readable (no foreground/background clashes).",
        "No hard-coded light-only colors remain in the major screens that cause obvious visual breakage in Dark mode.",
        "Toggling between Light and Dark does not break layout or cause missing UI elements."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn UI sources are read-only and must be composed, not edited).",
    "Do not edit immutable paths listed by the platform (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "No backend (Motoko) changes are required for dark mode.",
    "No new authentication methods or third-party theming libraries beyond what is already present."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}