{
  "kind": "build_request",
  "title": "Fix recurring chores save flow and persistence",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Diagnose and fix the recurring chores create/update flow so that pressing “Create Chore” / “Update Chore” reliably writes the record to the backend and the UI immediately reflects the saved state (including after closing and reopening the dialog).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Recurring chores flow still not working or saving correctly"
        ]
      },
      "acceptanceCriteria": [
        "Creating a recurring chore from the Recurring Chores dialog results in a new item appearing in the “Existing Recurring Chores” list without requiring a full page refresh.",
        "Editing an existing recurring chore updates the item shown in the list immediately after the save completes.",
        "If the backend rejects the mutation, the dialog remains open and the user sees an English error message explaining the failure."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend persistence for recurring chores across canister upgrades by storing recurring chores and the recurring chore ID counter in stable state using preupgrade/postupgrade hooks (Motoko). Ensure existing behavior (ownership enforcement, validation, pause/resume, list/get APIs) remains unchanged.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Recurring chores flow still not working or saving correctly"
        ]
      },
      "acceptanceCriteria": [
        "After creating recurring chores, performing a canister upgrade does not delete them.",
        "After a canister upgrade, creating a new recurring chore uses a non-colliding ID (the counter resumes correctly).",
        "getAllRecurringChores returns the same set of chores before and after upgrade (except for intentional changes like delete)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve recurring chore save reliability diagnostics: add structured console logging (frontend + backend) around create/update/pause/delete showing key fields (id, weekday, timeline, assignedTo presence) and backend traps, so failures can be pinpointed quickly without changing user-facing behavior.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Recurring chores flow still not working or saving correctly"
        ]
      },
      "acceptanceCriteria": [
        "On each recurring chore mutation attempt, the frontend logs the outgoing payload fields and the mutation outcome (success/failure).",
        "On backend trap, the frontend toast shows a clear English message and the console includes detailed diagnostic info (operation + raw trap/agent message)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the Recurring Chores dialog form submit cannot silently fail due to UI state: the Save button must always submit the correct form, remain enabled only when inputs are valid, and show a clear pending state while the mutation is in-flight.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Recurring chores flow still not working or saving correctly"
        ]
      },
      "acceptanceCriteria": [
        "When the Save button is clicked, the corresponding create/update mutation is fired exactly once.",
        "While saving, the Save button shows “Saving...” and is disabled until completion.",
        "After a successful save, the form resets and the user can see the saved item in the list."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo.",
    "Only add backend/migration.mo if state migration is required for existing deployments (conditional migration policy).",
    "Do not edit frontend files under frontend/src/components/ui or any paths listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Do not add new recurring chore product features (e.g., new schedule types, notifications, reminders).",
    "Do not introduce external databases or non-Internet Computer storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}