{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Add Task disabled gating by decoupling actor readiness from background fetch",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Decouple Add Task button enablement from React Query fetch state so it enables as soon as the backend actor exists (while still blocking when actor is missing/errored or mutation is pending).",
      "acceptanceCriteria": [
        "When the user opens the Add Task dialog, the “Add Task” submit button becomes enabled as soon as the actor is available (even if a background fetch is happening), as long as a non-empty task name is provided and no mutation is pending.",
        "The submit button remains disabled only when: task name is empty, addTask mutation is pending, or actor initialization has not produced an actor yet, or initialization errored.",
        "The user can successfully add a task end-to-end: enter a task name, click “Add Task”, see success toast, dialog closes, and the task list updates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActorWithReadiness.ts",
          "operation": "modify",
          "description": "Fix readiness derivation so `isReady` reflects actor availability (actor exists) and is not gated by `isFetching`; keep `isInitializing` true only when no actor exists yet and initialization is still in progress. Ensure `initError` is preserved for failed initialization. (Do not modify immutable frontend/src/hooks/useActor.ts.)"
        },
        {
          "path": "frontend/src/utils/actorAvailability.ts",
          "operation": "modify",
          "description": "Align `isActorAvailable(...)` and related helpers with the updated readiness semantics so availability is based on “actor exists and no initError”, not on background fetch state; keep `getActorAvailabilityMessage(...)` behavior for initializing and error states."
        },
        {
          "path": "frontend/src/components/AddTaskDialog.tsx",
          "operation": "modify",
          "description": "Update submit-button disabled logic to rely on actor existence/initialization error (via updated `useActorWithReadiness` + `actorAvailability` helpers) rather than React Query fetch-in-progress; ensure the button is enabled when actor exists even if background fetch is happening, and remains disabled only for empty task name, pending addTask mutation, missing actor, or init error."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep Add Task disabled-state messaging accurate during backend initialization/failure and provide a clear tooltip when the task name is missing.",
      "acceptanceCriteria": [
        "If the backend actor is still initializing (no actor yet), the dialog shows the existing connection message (“Connecting to backend… please wait a moment.”) and the submit button stays disabled.",
        "If backend initialization fails, the dialog shows the existing failure message (“Backend connection failed. Please refresh the page and try again.”) and the submit button stays disabled.",
        "If the only reason the button is disabled is missing task name, the tooltip/title explains “Task name is required.”"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AddTaskDialog.tsx",
          "operation": "modify",
          "description": "Ensure the connection/failure helper messages remain the only ones shown when actor is initializing/failed, and adjust the submit button `title`/tooltip string so that when the only disabled reason is missing name it exactly reads “Task name is required.” (including punctuation)."
        },
        {
          "path": "frontend/src/utils/actorAvailability.ts",
          "operation": "modify",
          "description": "Confirm messaging strings remain exactly as required for initializing and failure states and that the generic “not ready” message is not shown in cases where an actor exists but a background fetch is in progress."
        }
      ]
    }
  ]
}