{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Harden actor initialization and surface real readiness/init errors",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make access-control initialization conditional, non-blocking, and expose actor query error state to the UI.",
      "acceptanceCriteria": [
        "When caffeineAdminToken is missing/empty, the app does not attempt to call _initializeAccessControlWithSecret during actor initialization.",
        "If _initializeAccessControlWithSecret throws/traps, the actor is still returned when possible (so the app can proceed for non-admin use cases) and the error is available to the UI via the hook.",
        "If actor creation fails (e.g., canister unavailable), the hook exposes a non-null error state (not just `actor: null`)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Update the actor React Query to: (1) only call access-control initialization when getSecretParameter('caffeineAdminToken') returns a non-empty string, (2) wrap _initializeAccessControlWithSecret in try/catch so actor creation can still succeed for non-admin flows even if AC init fails, and (3) return the query error state from React Query alongside actor/isFetching (e.g., include an `error` field sourced from actorQuery.error). Also ensure actor creation failures propagate to React Query so `error` becomes non-null."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Use real actor initialization error state to derive consistent readiness flags for accurate backend status messaging.",
      "acceptanceCriteria": [
        "When the backend canister cannot be reached or actor initialization fails, AddTaskDialog shows the “Backend connection failed…” message (from actorAvailability) instead of the generic “Backend is not ready…”.",
        "When the actor is still being created, AddTaskDialog shows the “Connecting to backend…” message, and transitions to enabled submission automatically once ready.",
        "When the actor is ready, the Add Task submit button is enabled (assuming required fields are filled) without requiring a page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActorWithReadiness.ts",
          "operation": "modify",
          "description": "Consume the newly exposed `error` state from useActor and set `initError` accordingly. Ensure derived flags follow the contract: `isInitializing` true only while fetching and no actor yet; `isReady` true only when actor exists and not fetching; `initError` non-null when actor initialization failed (query error)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add structured, non-sensitive diagnostics for actor creation and access-control initialization to clarify failure origin without noisy repeats.",
      "acceptanceCriteria": [
        "Console output clearly indicates whether failure occurred during actor creation vs access-control initialization, without logging secrets.",
        "A developer can reproduce a backend-down scenario and see a single, clear diagnostic failure path (no noisy repeated logs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Add structured console diagnostics around actor creation and access-control initialization using existing utilities in frontend/src/utils/deploymentDiagnostics.ts and/or frontend/src/utils/actorInitDiagnostics.ts. Log step start/success/failure with safe, redacted details (e.g., log boolean `hasAdminToken` rather than the token). Adjust the actor query options to avoid noisy repeated logs on failures (e.g., disable React Query retries for the actor query and avoid unnecessary refetch triggers on error)."
        }
      ]
    }
  ]
}