{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reusable hero header images for main tabs",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a reusable HeroHeader component with responsive, accessible hero image styling used across main tab views.",
      "acceptanceCriteria": [
        "A reusable hero/header component exists and can be used by Task List, Dinner Rota, Calendar, and People views.",
        "Hero section is responsive (maintains aspect ratio, crops via object-cover), has rounded corners, and uses an overlay to ensure any text remains readable.",
        "All hero images have non-empty, descriptive alt text in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroHeader.tsx",
          "operation": "create",
          "description": "Create a reusable HeroHeader component that renders a static hero image with consistent styling: responsive aspect ratio, object-cover cropping, rounded corners, and a gradient overlay layer to improve text readability; supports passing non-empty English alt text and optional title/subtitle content."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add distinct hero images to Task List, Dinner Rota, Calendar, and People tab views using the new HeroHeader styling.",
      "acceptanceCriteria": [
        "Task List shows a hero image above the \"Household Tasks\" header content.",
        "Dinner Rota shows a hero image in its header area (keeping or replacing the existing image block, but using the new consistent hero/header styling).",
        "Calendar shows a hero image above the \"Calendar View\" header content.",
        "People shows a hero image above the \"People\" header content.",
        "No hero images are loaded via backend; all are served as static assets."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TaskList.tsx",
          "operation": "modify",
          "description": "Import and render the new HeroHeader component at the top of the Task List view, above the existing \"Household Tasks\" header area, using the static asset path /assets/generated/hero-task-list.dim_1600x400.jpg with a descriptive English alt text."
        },
        {
          "path": "frontend/src/components/DinnerRota.tsx",
          "operation": "modify",
          "description": "Replace (or refactor) the existing header image block to use the new HeroHeader component for consistent styling, referencing /assets/generated/hero-dinner-rota.dim_1600x400.jpg with a descriptive English alt text; ensure it appears in the header area above the main Dinner Rota content."
        },
        {
          "path": "frontend/src/components/CalendarView.tsx",
          "operation": "modify",
          "description": "Import and render the new HeroHeader component at the top of the Calendar view, above the existing \"Calendar View\" header area, referencing /assets/generated/hero-calendar.dim_1600x400.jpg with a descriptive English alt text."
        },
        {
          "path": "frontend/src/components/People.tsx",
          "operation": "modify",
          "description": "Import and render the new HeroHeader component at the top of the People view, above the existing \"People\" header area, referencing /assets/generated/hero-people.dim_1600x400.jpg with a descriptive English alt text."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add generated hero images as static assets under frontend/public/assets/generated and reference them via absolute paths.",
      "acceptanceCriteria": [
        "All new hero image files exist under frontend/public/assets/generated.",
        "Each tab references its corresponding hero image path and renders successfully in the browser without 404s."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/hero-task-list.dim_1600x400.jpg",
          "operation": "create",
          "description": "Add the generated static hero image asset for the Task List tab: frontend/public/assets/generated/hero-task-list.dim_1600x400.jpg."
        },
        {
          "path": "frontend/public/assets/generated/hero-dinner-rota.dim_1600x400.jpg",
          "operation": "create",
          "description": "Add the generated static hero image asset for the Dinner Rota tab: frontend/public/assets/generated/hero-dinner-rota.dim_1600x400.jpg."
        },
        {
          "path": "frontend/public/assets/generated/hero-calendar.dim_1600x400.jpg",
          "operation": "create",
          "description": "Add the generated static hero image asset for the Calendar tab: frontend/public/assets/generated/hero-calendar.dim_1600x400.jpg."
        },
        {
          "path": "frontend/public/assets/generated/hero-people.dim_1600x400.jpg",
          "operation": "create",
          "description": "Add the generated static hero image asset for the People tab: frontend/public/assets/generated/hero-people.dim_1600x400.jpg."
        }
      ]
    }
  ]
}