{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Voice dictation: add a clear listening indicator + accessibility semantics",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a subtle but clearly visible “listening” indicator to VoiceDictationButton whenever SpeechRecognition is active, so it appears consistently everywhere the button is used.",
      "acceptanceCriteria": [
        "When dictation is actively listening, the mic control has an additional visible indicator (e.g., a small red 'live' dot, glow ring, or similar subtle accent) that is not shown when not listening.",
        "The listening indicator turns on only while `isListening` is true for the active dictation field, and turns off immediately when dictation stops/ends/errors.",
        "The indicator is visible and legible on both light and dark themes and does not rely solely on color (e.g., uses shape/animation as well).",
        "The existing tooltip behavior remains correct (Start voice dictation vs Stop dictation), and the button remains operable on mobile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VoiceDictationButton.tsx",
          "operation": "modify",
          "description": "Enhance the existing shadcn-ui Button/Tooltip-based VoiceDictationButton to render an additional, subtle listening indicator when `isListening` is true (e.g., an overlaid dot + ring/glow/animation that also communicates state via shape/motion, not color alone), while preserving the current icon pulse and current tooltip text logic. Ensure the indicator styling works in both light/dark themes and does not reduce tap-target usability on mobile. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Expose accessibility semantics for the dictation listening state so assistive technologies can detect and announce when dictation is active.",
      "acceptanceCriteria": [
        "When listening, the dictation control exposes an appropriate state to screen readers (e.g., `aria-pressed=true` and/or an `aria-live` status text that announces \"Listening\" / \"Not listening\").",
        "User-facing accessibility text is in English.",
        "No accessibility attributes are added to any immutable-path files."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VoiceDictationButton.tsx",
          "operation": "modify",
          "description": "Add screen-reader-detectable semantics for listening state on the dictation control (e.g., `aria-pressed` reflecting `isListening` and a small `aria-live` status message announcing \"Listening\" / \"Not listening\" in English). Keep existing `aria-label` and tooltip behavior correct, and ensure all a11y attributes are confined to this non-immutable component file. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}