{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "App color scheme suggestions + updated light/dark theme tokens",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Provide 3 cohesive color scheme suggestions and apply one selected scheme by updating existing theme CSS variables so the palette consistently affects the current UI in light and dark mode.",
      "acceptanceCriteria": [
        "A short list of 3 color scheme suggestions is included in the change description (name + brief description for each).",
        "One scheme is selected as the default and applied by modifying the existing theme CSS variables in frontend/src/index.css for both :root (light) and .dark (dark).",
        "Primary/secondary/accent/muted/background/foreground/border/ring/destructive/success and chart/sidebar tokens remain defined and produce a cohesive look.",
        "The Login screen background gradient (currently using from-background to muted/20) and key UI surfaces (Header bg-card, Cards, TabsList) visually reflect the new palette without requiring component-by-component hardcoded colors.",
        "Text contrast remains readable in both light and dark mode (e.g., primary buttons have clear primary-foreground contrast; muted-foreground remains legible on muted backgrounds)."
      ],
      "file_operations": [
        {
          "path": "frontend/theme-scheme-suggestions.md",
          "operation": "create",
          "description": "Add a short, reviewable list of 3 distinct app color scheme suggestions (name + brief description each) and clearly indicate which one is chosen as the default to implement. (This file serves as the required ‘change description’ artifact.)"
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the existing light (:root) and dark (.dark) CSS variable theme tokens (oklch(var(--...))) to apply the selected default scheme across the app (header, tabs, cards, buttons, dialogs, gradients). Ensure tokens remain defined for: primary/secondary/accent/muted/background/foreground/border/ring/destructive/success plus chart and sidebar tokens, with readable contrast in both modes (including the LoginScreen gradient from-background to muted/20)."
        }
      ]
    }
  ]
}