{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Edit/Delete controls for tasks and recurring chores in calendar day/week planners",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add creator-only per-task Edit/Delete controls in CalendarDayPlanner with confirmation + existing edit dialog and delete mutation.",
      "acceptanceCriteria": [
        "In the day planner task list, each task created by the current user shows Edit and Delete controls.",
        "Clicking Edit opens the existing task edit dialog pre-filled with that task’s fields and successfully saves via the existing update path.",
        "Clicking Delete shows a confirmation prompt and, on confirmation, deletes the task via the existing mutation and refreshes the calendar/task data (React Query invalidation).",
        "Tasks not created by the current user do not show Edit/Delete controls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CalendarDayPlanner.tsx",
          "operation": "modify",
          "description": "Add creator-only Edit/Delete UI controls for each task in the day task list. Use the existing EditTaskDialog to edit a selected task (track selectedTask + dialog open state), and use the existing useDeleteTask mutation with a confirmation prompt to delete. Determine creator-only visibility by comparing task.createdBy with the authenticated principal from useInternetIdentity (compare via toString()). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add creator-only per-task Edit/Delete controls in CalendarWeekPlanner with confirmation + existing edit dialog and delete mutation.",
      "acceptanceCriteria": [
        "In the week planner, tasks created by the current user show Edit/Delete controls on their task row/card.",
        "Edit opens EditTaskDialog and successfully updates the task.",
        "Delete confirms and successfully removes the task, with UI reflecting the change without a full page reload.",
        "Tasks not created by the current user do not show Edit/Delete controls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CalendarWeekPlanner.tsx",
          "operation": "modify",
          "description": "Add creator-only Edit/Delete UI controls to each task row/card in the week view. Open the existing EditTaskDialog for the selected task (add selectedTask + open state in this component), and delete via the existing useDeleteTask mutation after a confirmation prompt. Ensure UI updates via existing React Query invalidation in the mutation (no full reload). Determine creator-only visibility by comparing task.createdBy with the authenticated principal from useInternetIdentity (compare via toString()). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Enable creator-only edit/delete actions for recurring chores surfaced in CalendarDayPlanner and CalendarWeekPlanner using existing recurring chore flows and delete mutation.",
      "acceptanceCriteria": [
        "In both day and week planner recurring chores sections, chores created by the current user expose Edit/Delete actions (or an equivalent per-chore action menu).",
        "Edit allows changing recurring chore fields and persists changes via the existing updateRecurringChore mutation (with expected React Query invalidation so calendar/task views refresh).",
        "Delete prompts for confirmation and deletes via the existing deleteRecurringChore mutation, removing the chore from relevant views after refresh/invalidation.",
        "Recurring chores not created by the current user do not show Edit/Delete actions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RecurringChoresDialog.tsx",
          "operation": "modify",
          "description": "Extend the existing recurring chore edit flow to support being opened from calendar views directly into editing a specific chore (e.g., add an optional prop to accept an initial chore to edit and apply it when the dialog opens). Keep creator-only edit/delete enforcement consistent with the dialog’s existing canEditChore check. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CalendarDayPlanner.tsx",
          "operation": "modify",
          "description": "In the day planner recurring chores list, add creator-only Edit/Delete actions per chore. For Edit, open the existing recurring chore update flow by opening RecurringChoresDialog preloaded to edit the selected chore (using the new RecurringChoresDialog capability). For Delete, prompt for confirmation and call the existing useDeleteRecurringChore mutation. Determine creator-only visibility by comparing chore.createdBy with the authenticated principal from useInternetIdentity (compare via toString()). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CalendarWeekPlanner.tsx",
          "operation": "modify",
          "description": "In the week planner recurring chores sections, add creator-only Edit/Delete actions per chore. For Edit, open RecurringChoresDialog preloaded to edit that chore (using the new RecurringChoresDialog capability). For Delete, prompt for confirmation and call the existing useDeleteRecurringChore mutation. Determine creator-only visibility by comparing chore.createdBy with the authenticated principal from useInternetIdentity (compare via toString()). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}