{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Family House Duties is an Internet Computer (ICP) dapp for shared household coordination. Authenticated users (via Internet Identity) can manage one-off household tasks (create/edit/delete, optional assignee and due date, mark complete, clear own completed tasks), maintain a weekly dinner rota (assign/update daily cook with ownership rules), and plan via calendar views (month/week/day) plus a “Today’s Focus” dashboard. The app also supports recurring chores with weekly/fortnightly/monthly schedules, including pause/resume, and a People directory to map principals to friendly names and colors used throughout the UI. The backend is a Motoko canister enforcing role-based access control and per-record ownership rules, with the first admin bootstrapped via an environment token.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication",
      "synonyms": [
        "II login",
        "AuthClient provider"
      ],
      "description": "Provides login/logout via Internet Identity, restores prior sessions on app load, and exposes identity + status flags via a React context hook (useInternetIdentity).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Identity-bound ICP actor creation and lifecycle",
      "synonyms": [
        "useActor",
        "actor factory"
      ],
      "description": "Creates an anonymous actor when unauthenticated and an identity-bound actor when authenticated; recreates actor on identity change and invalidates/refetches dependent React Query caches.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Admin bootstrap via secret token",
      "synonyms": [
        "CAFFEINE_ADMIN_TOKEN bootstrap",
        "access-control init"
      ],
      "description": "On actor initialization, the frontend sends a secret token; the canister compares it to an environment token to assign the first admin, otherwise registering users as normal users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control APIs",
      "synonyms": [
        "authorization mixin",
        "AccessControl roles"
      ],
      "description": "Canister enforces roles (#admin/#user/#guest) and exposes methods to get caller role, check admin status, and assign roles (admin-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Task creation with optional due date and assignee",
      "synonyms": [
        "addTask",
        "create task"
      ],
      "description": "Users can create tasks with name/description and optional due date (Time) and assignee (Principal). Backend stores createdBy and assigns incrementing IDs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Task editing with ownership enforcement",
      "synonyms": [
        "updateTask"
      ],
      "description": "Tasks can be updated (name/description/dueDate/assignedTo) only by the creator; UI hides edit controls when the current user is not the task creator.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Task deletion with ownership enforcement",
      "synonyms": [
        "deleteTask"
      ],
      "description": "Creators can delete their tasks with confirmation; backend prevents deletion by non-creators.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Task completion toggling",
      "synonyms": [
        "mark complete",
        "toggleTaskCompletion"
      ],
      "description": "Tasks can be toggled completed/pending; UI visually distinguishes completed items and separates pending vs completed lists.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Clear my completed tasks",
      "synonyms": [
        "clearCompletedTasks",
        "bulk clear"
      ],
      "description": "Users can remove all tasks they created that are marked completed; UI offers a confirmation-based action in the completed section.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Task list UI grouped by due day",
      "synonyms": [
        "groupTasksByDay",
        "task day grouping"
      ],
      "description": "Frontend groups tasks by normalized local day key (yyyy-MM-dd) and displays day headers, plus a dedicated \"No due date\" group.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Dinner rota: cooking assignment CRUD (create/update)",
      "synonyms": [
        "assignCookingDay",
        "updateCookingDay"
      ],
      "description": "Users can assign cooks to day keys (yyyy-MM-dd) with optional cookName and optional cook principal; existing assignments can only be edited by the original assigner (assignedBy).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Dinner rota fairness indicator",
      "synonyms": [
        "cooking fairness stats",
        "most/least cooked"
      ],
      "description": "Computes per-person cooking counts over selectable ranges (e.g., last 30 days, all time) and displays most/least highlights plus a proportional bar list.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Calendar views (month/week/day) combining tasks, cooking, and chores",
      "synonyms": [
        "CalendarView",
        "planning views"
      ],
      "description": "Provides a calendar module with month grid, week planner, and day planner views; uses day keys to match tasks (by due date) and cooking assignments and overlays recurring chores per date.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Lightweight month overview with indicators",
      "synonyms": [
        "mini month calendar",
        "Month Overview"
      ],
      "description": "Compact month component with month navigation and date selection, showing dot indicators for days with tasks and/or cooking assignments.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Today’s Focus dashboard card",
      "synonyms": [
        "daily snapshot",
        "today panel"
      ],
      "description": "Shows tasks due today and today’s cooking assignment using profile-aware labels, with skeleton loading and empty states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Recurring chores: create/update/delete",
      "synonyms": [
        "recurring tasks",
        "recurrence management"
      ],
      "description": "Users can manage recurring chores with name/description, weekday, frequency (weekly/fortnightly/monthly), and optional assignee principal; backend enforces creator-only edits and validation of weekday (0–6).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Recurring chores: pause/resume",
      "synonyms": [
        "pause recurring chore",
        "resume recurring chore"
      ],
      "description": "Creators can pause or resume recurring chores; paused chores are excluded from date appearance logic in calendar planners and marked as paused in the UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Recurring chores scheduling rules (weekly/fortnightly/monthly)",
      "synonyms": [
        "shouldChoreAppearOnDate",
        "recurrence engine"
      ],
      "description": "Client-side scheduling determines if a chore appears on a given date: weekly matches weekday; fortnightly uses a fixed reference date for even/odd weeks; monthly appears on the first weekday occurrence (day 1–7), excluding paused chores.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Inline recurring chores preview section with expand/collapse",
      "synonyms": [
        "RecurringChoresInlineSection",
        "recurring preview list"
      ],
      "description": "Shows recurring chores grouped by weekday (sorted starting from today), includes frequency labels and paused badges, provides a smooth scan-friendly layout, and offers an in-place Show more/Show less control to reveal additional weekday groups without navigation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "People profiles (principal → display name + color) CRUD",
      "synonyms": [
        "People tab",
        "PersonProfile directory"
      ],
      "description": "Users can create/update/delete and list person profiles containing principal, display name, and color; backend restricts profile management to the profile owner (caller must equal profile.principal).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Profile-aware labels, badges, and selectors",
      "synonyms": [
        "PersonBadge",
        "PersonProfileSelect"
      ],
      "description": "Provides reusable UI for displaying people with color dots and selecting assignees/cooks via profiles or manual principal entry, including a “Me” shortcut; used across tasks, dinner rota, and planners.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "React Query API hooks for all canister operations",
      "synonyms": [
        "useQueries",
        "mutation/query layer"
      ],
      "description": "Typed hooks for tasks, cooking assignments, recurring chores, and profiles; includes consistent cache invalidation, toast notifications, and improved recurring chore error normalization.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Principal parsing and validation utilities",
      "synonyms": [
        "safeParsePrincipal",
        "principal input validation"
      ],
      "description": "Provides safe, non-throwing principal parsing for form validation and clearer user feedback when principal IDs are invalid.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Deployment/initialization diagnostic logging utilities",
      "synonyms": [
        "withDiagnostics",
        "deploymentDiagnostics"
      ],
      "description": "Structured console logging helpers to time and classify failures across config load, actor creation, access-control init, query, and mutation execution steps with actionable guidance.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "App shell with theming, navigation, and logout cache reset",
      "synonyms": [
        "tabs layout",
        "dark mode"
      ],
      "description": "Tab-based navigation (Tasks, Dinner Rota, Calendar, People), global header/footer, system/light/dark theme support, and logout that clears identity and react-query caches.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-diagnose-and-fix-the-recurring-chores-create-update-flow-so-that-pressing-create-chore-update-chore-reliably-writes-the-record-to-the-backend-and-the-ui-immediately-reflects-the-saved-state-including-after-closing-and-reopening-the-dialog",
      "title": "Diagnose and fix the recurring chores create/update flow so that pressing “Create Chore” / “Update Chore” reliably writes the record to the backend and the UI immediately reflects the saved state (including after closing and reopening the dialog).",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-improve-recurring-chore-save-reliability-diagnostics-add-structured-console-logging-frontend-backend-around-create-update-pause-delete-showing-key-fields-id-weekday-timeline-assignedto-presence-and-backend-traps-so-failures-can-be-pinpointed-quickly-without-changing-user-facing-behavior",
      "title": "Improve recurring chore save reliability diagnostics: add structured console logging (frontend + backend) around create/update/pause/delete showing key fields (id, weekday, timeline, assignedTo presence) and backend traps, so failures can be pinpointed quickly without changing user-facing behavior.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-recurring-chores-dialog-form-submit-cannot-silently-fail-due-to-ui-state-the-save-button-must-always-submit-the-correct-form-remain-enabled-only-when-inputs-are-valid-and-show-a-clear-pending-state-while-the-mutation-is-in-flight",
      "title": "Ensure the Recurring Chores dialog form submit cannot silently fail due to UI state: the Save button must always submit the correct form, remain enabled only when inputs are valid, and show a clear pending state while the mutation is in-flight.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-2",
      "summary": "Add backend persistence for recurring chores across canister upgrades by storing recurring chores and the recurring chore ID counter in stable state using preupgrade/postupgrade hooks (Motoko). Ensure existing behavior (ownership enforcement, validation, pause/resume, list/get APIs) remains unchanged.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is a React SPA using @tanstack/react-query for all canister I/O (queries + mutations), with cache invalidation on mutation success and toast notifications for feedback.",
    "Authentication uses Internet Identity via AuthClient inside a React context (InternetIdentityProvider) that restores persisted sessions and exposes login status flags.",
    "Backend integration follows an ICP “actor” pattern: useActor creates an anonymous or identity-bound actor; on identity change it invalidates/refetches all non-actor queries.",
    "Role-based access control is implemented on-canister (AccessControl) and composed into the main actor via a Motoko mixin (MixinAuthorization).",
    "Admin bootstrap is token-based: the canister reads CAFFEINE_ADMIN_TOKEN (env var) and compares it to a user-provided secret passed from the frontend; first matching caller becomes admin, otherwise callers become users.",
    "Sensitive bootstrap tokens are handled on the frontend via URL hash extraction + sessionStorage persistence, and immediately removed from the URL to reduce leakage.",
    "UI is built with TailwindCSS + shadcn/ui primitives (Card, Dialog, Tabs, etc.) and next-themes for system/light/dark mode.",
    "Date handling is normalized in the frontend using yyyy-MM-dd day keys for grouping tasks and matching cooking assignments, reducing timestamp equality issues.",
    "Recurring chore scheduling is implemented client-side for calendar/day/week planners via deterministic rules (weekly/fortnightly anchored reference date/monthly first-week rule) and excludes paused chores.",
    "Input robustness utilities exist for principal parsing (safeParsePrincipal) and for more diagnosable initialization failures (deploymentDiagnostics)."
  ],
  "known_issues": [
    "Backend getCalendar() appears incorrect: it looks up cooking assignments using cookingAssignments.get(task.name) instead of the day key, and it emits one CalendarDay per task rather than aggregating by date; it also omits days with cooking-only items or no tasks.",
    "Backend getTasksByDate(date) matches dueDate using exact timestamp equality; the UI treats due dates at day granularity, so this can easily return no matches unless the exact nanosecond value is provided.",
    "Backend state is held in in-memory vars/Maps (e.g., tasks, cookingAssignments, recurringChores, peopleProfiles, nextTaskId) with no stable persistence shown; canister upgrades/redeployments will likely reset data unless stable storage hooks exist elsewhere.",
    "frontend/src/components/ProfileSetup.tsx is an empty placeholder file, but other project documentation implies a profile setup flow exists; if referenced in routing/UX elsewhere, it will be missing.",
    "Duplicate global CSS token files exist (frontend/index.css and frontend/src/index.css) with different theme variables; depending on bundling/imports, this can cause confusing or inconsistent styling.",
    "Recurring chore error normalization includes messaging about missing person profiles (\"Person profile does not exist\"), but the backend explicitly removed the check requiring assigned principals to have a profile; some user-facing errors may be misleading.",
    "Recurring chores UX/save flow still not working reliably: users report they still cannot save or the flow is incorrect even after adding a scrollable pop-up; likely form/scroll/modal behavior or mutation not firing/persisting consistently."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Family House Duties",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}