{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 76,
  "summary": "Family House Duties is an Internet Computer (ICP) dapp for shared household management. Authenticated family members (via Internet Identity) can create and manage household tasks (with optional assignee and due date), mark tasks complete, and clear their own completed tasks. The app also provides a weekly “Dinner Rota” for assigning who cooks on each day, plus calendar views combining tasks and cooking assignments. A Motoko canister implements storage and role-based access control, including an admin bootstrap mechanism via a secret token. The app now also supports household member “People” profiles to provide friendly names/labels in place of raw principal IDs and to improve person selection across the UI.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "Internet Identity login",
        "II auth context"
      ],
      "description": "Provides login/logout via DFINITY AuthClient, loads persisted identity on mount, exposes login status flags, and supplies an Identity to the rest of the app through React context.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Actor creation and initialization per principal",
      "synonyms": [
        "useActor",
        "ICP actor factory"
      ],
      "description": "Creates an anonymous actor when unauthenticated and an identity-bound actor when authenticated; initializes access control using a secret token; caches the actor per principal and forces refetch of dependent queries when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Secret admin token extraction from URL hash",
      "synonyms": [
        "hash secret token",
        "URL token persistence"
      ],
      "description": "Utilities to read sensitive parameters from the URL hash fragment, store them in sessionStorage for the session, and remove them from the URL to reduce leakage (used for caffeineAdminToken).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control (admin/user/guest)",
      "synonyms": [
        "AccessControl",
        "authorization mixin"
      ],
      "description": "Motoko AccessControl module tracks user roles and permissions; MixinAuthorization exposes APIs to initialize roles, check caller admin status, read caller role, and assign roles (admin-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Task creation",
      "synonyms": [
        "add task",
        "create chore"
      ],
      "description": "Authenticated users can add household tasks with name, description, optional due date, and optional assignee (Principal). Backend stores createdBy as the caller and assigns an incrementing task id.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Task editing with ownership enforcement",
      "synonyms": [
        "update task"
      ],
      "description": "Users can update task fields (name, description, due date, assignee). Backend enforces that only the original creator (createdBy) may edit the task; UI only shows edit controls to the creator.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Task deletion with ownership enforcement",
      "synonyms": [
        "delete task",
        "remove chore"
      ],
      "description": "Users can delete tasks they created (with confirm in UI). Backend rejects deletion by non-creators.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Task completion toggling",
      "synonyms": [
        "mark complete",
        "toggle completed"
      ],
      "description": "Users can toggle a task’s completed state; UI separates pending vs completed tasks and applies visual styling (line-through/opacity) for completed tasks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Clear my completed tasks",
      "synonyms": [
        "bulk clear completed"
      ],
      "description": "Users can clear all completed tasks that they created; backend filters by completed == true and createdBy == caller.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Task browsing and display with principal metadata",
      "synonyms": [
        "task list UI",
        "getAllTasks"
      ],
      "description": "UI fetches all tasks and displays creator and assignee principal IDs (shortened), optional due date badges, and uses loading skeletons and empty-state artwork.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Dinner rota: weekly cooking assignment management",
      "synonyms": [
        "cooking schedule",
        "meal planning rota"
      ],
      "description": "Users can assign a cook (Principal) to each day of the current week. New assignments can be created; existing assignments can be updated only by the user who originally assigned them (assignedBy ownership rule).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Calendar overview (monthly)",
      "synonyms": [
        "calendar view",
        "monthly dashboard"
      ],
      "description": "Monthly grid that visualizes tasks (up to 2 per day plus “+n more”) and cooking assignments per day, with navigation between months and styling for today/current month.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "React Query API layer for tasks and cooking assignments",
      "synonyms": [
        "useQueries hooks"
      ],
      "description": "Typed query and mutation hooks for tasks (CRUD, toggle, clear completed), cooking assignments (list, assign, update), and calendar retrieval; includes cache invalidation and toast-based success/error feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Motoko data migration for schema changes",
      "synonyms": [
        "canister upgrade migration"
      ],
      "description": "Migration module maps old task/assignment models (Text-based principals) to new models using Principal types and adds createdBy/assignedBy fields (initialized to anonymous for migrated records).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Application shell and theming",
      "synonyms": [
        "tabs layout",
        "dark mode"
      ],
      "description": "Authenticated app shell with header (principal dropdown + logout), footer attribution, tab navigation between Tasks/Dinner/Calendar, toast notifications, and system/light/dark theme support.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Profile setup UI (member profile capture)",
      "synonyms": [
        "profile setup flow",
        "ProfileSetup screen"
      ],
      "description": "Implements the previously-empty ProfileSetup component to support an in-app profile setup step for authenticated users (replacing the prior placeholder).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Recurring chores dialog (UI)",
      "synonyms": [
        "recurring tasks",
        "RecurringChoresDialog"
      ],
      "description": "Adds a UI dialog for creating/managing recurring chores, complementing one-off task creation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Recurring chores inline section with previews",
      "synonyms": [
        "RecurringChoresInlineSection",
        "recurring chores preview"
      ],
      "description": "Adds an inline recurring-chores section in the Tasks UI, including utilities to generate human-readable previews of recurrence patterns and integrate them alongside one-off task workflows.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "People profiles (household member directory)",
      "synonyms": [
        "People page",
        "member profiles",
        "person profiles"
      ],
      "description": "Adds a People area and supporting data layer for managing household member profiles (used to represent principals with friendly names/labels) and to power person-selection controls across the app.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Person/profile-aware UI labels and selectors",
      "synonyms": [
        "PersonBadge",
        "PersonProfileSelect",
        "friendly principal display"
      ],
      "description": "Updates task, dinner rota, and related UI surfaces to display and select people using profile-backed labels/badges instead of only shortened principal IDs, improving readability and assignment workflows.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Calendar planning subviews (day/week planners and lightweight month overview)",
      "synonyms": [
        "CalendarDayPlanner",
        "CalendarWeekPlanner",
        "LightweightMonthOverview"
      ],
      "description": "Extends the calendar experience with dedicated day and week planning components and a lightweight month overview to better browse and plan tasks and cooking assignments.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-add-a-persistent-today-focus-section-rendered-at-the-top-of-the-authenticated-app-content-below-the-header-and-above-the-tab-navigation-content-so-it-remains-visible-regardless-of-which-main-view-tab-is-active-tasks-dinner-rota-calendar-people",
      "title": "Add a persistent \"Today Focus\" section rendered at the top of the authenticated app content (below the Header and above the tab navigation/content) so it remains visible regardless of which main view/tab is active (Tasks, Dinner Rota, Calendar, People).",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-in-the-today-focus-section-display-only-tasks-that-are-due-today-based-on-local-calendar-day-and-show-today-s-assigned-cook-for-today-s-day-key-do-not-include-tasks-for-other-days-or-tasks-without-a-due-date",
      "title": "In the Today Focus section, display only tasks that are due today (based on local calendar day) and show today’s assigned cook for today’s day key; do not include tasks for other days or tasks without a due date.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-appropriate-loading-and-empty-states-within-the-today-focus-section-using-existing-data-sources-react-query-hooks-so-the-panel-remains-stable-and-informative-while-tasks-cooking-assignments-and-profiles-if-used-for-labels-are-loading-or-absent",
      "title": "Implement appropriate loading and empty states within the Today Focus section using existing data sources (React Query hooks) so the panel remains stable and informative while tasks/cooking assignments (and profiles if used for labels) are loading or absent.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add a persistent “Today focus” panel at the top showing only today’s tasks and today’s assigned cook across all views.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is a React SPA using @tanstack/react-query for data fetching, caching, mutations, and cache invalidation patterns (invalidateQueries on mutation success).",
    "Authentication is handled through an InternetIdentityProvider (AuthClient) context that persists identities across reloads and exposes login/logout status flags.",
    "Backend integration uses an ICP actor pattern: a custom useActor hook creates an anonymous or authenticated actor and keeps it cached per principal (staleTime: Infinity).",
    "Role/permission enforcement is implemented on-canister via an AccessControl module and a MixinAuthorization mixin that adds admin/user role APIs to the main actor.",
    "Admin bootstrap uses an environment variable (CAFFEINE_ADMIN_TOKEN) and a user-provided secret passed from the frontend; first matching principal can become admin, others default to user.",
    "Sensitive token handling on the frontend uses hash-fragment secrets stored in sessionStorage and removed from the URL after extraction (getSecretParameter/getSecretFromHash).",
    "UI is built with TailwindCSS (OKLCH-based design tokens) and shadcn-style components (cards, dialogs, tabs, dropdowns), plus next-themes for dark mode.",
    "Motoko canister uses Map-based in-memory collections and includes a migration module to transform older schemas (Text principals) into new Principal-based records.",
    "Repository now includes a reusable build-template (React + ICP) with deployment scripts and canister configuration to standardize builds/deploys across environments.",
    "Frontend introduces a StorageClient utility to centralize browser storage access (e.g., session/local storage) for app-specific persistence needs.",
    "Frontend adds date/day-level grouping utilities (e.g., taskDueDayGrouping) to normalize due dates for calendar/task aggregation and reduce timestamp-equality pitfalls in UI rendering.",
    "Build-template expanded into a full reusable starter (React + ICP) including extensive shadcn/ui component set, custom ESLint rules (e.g., no BigInt in React Query keys; require InternetIdentityProvider usage), and helper scripts for image resizing/pruning to standardize scaffolding across projects.",
    "Introduces a People Profiles data model and query layer (e.g., usePeopleProfilesQueries + personProfiles utilities) to map principals to human-friendly profile metadata, reused by person-selection components and badges across tasks/rota/calendar.",
    "Authorization layer updated (MixinAuthorization + AccessControl) to component:authorization v4.0.0; core infrastructure updated to v1.0.2, reflected across backend integration and build-template scaffolding."
  ],
  "known_issues": [
    "Backend getTasksByDate() compares dueDate == date using exact timestamps; if the UI treats due dates as day-level values, this strict equality may not behave as expected unless callers normalize timestamps.",
    "There are two different CSS files shown (frontend/src/index.css and frontend/index.css) with conflicting token sets; if both are used or accidentally referenced, styling may be inconsistent or confusing to maintain."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "Family House Duties",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}